Revit 2025 API
DockPosition Enumeration
 Which part of the Revit application frame the pane should dock to.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DockPosition
Public Enumeration DockPosition
public enum class DockPosition
type DockPosition
Members
Member name | Value | Description
Top | 59,419
Left | 59,420
Right | 59,421
Bottom | 59,422
Floating | 59,423
Tabbed | 59,424
See Also
Reference
Autodesk.Revit.UI Namespace